---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.GeomStepFailedError
source: html/f562cd4a-9e9b-1ab1-0062-63712710e9eb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.GeomStepFailedError Property

Can't rebuild geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId GeomStepFailedError { get; }
```